# Series

In [96]:
# %config IPCompleter.greedy=True # setup completion hints
%config IPCompleter.use_jedi=False

In [4]:
import requests
download_url = "https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv"
target_csv_path = "nba_all_elo.csv"

response = requests.get(download_url)
response.raise_for_status()    # Check that the request was successful
with open(target_csv_path, "wb") as f:
    f.write(response.content)
print("Download ready.")

Download ready.

In [5]:
import pandas as pd
nba = pd.read_csv("nba_all_elo.csv")
type(nba)

pandas.core.frame.DataFrame

In [6]:
len(nba) # rows
nba.shape # dimensions

(126314, 23)

In [7]:
nba.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

To change the output to display different amount of columns, change the set_option()

In [8]:
pd.set_option("display.max.colums", None) # displays every column
pd.set_option("display.precision", 3) # only output to 2 decimals

OptionError: "No such keys(s): 'display.max.colums'"

In [9]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [10]:
nba.describe()
nba["team_id"].value_counts()

BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
INJ      60
PIT      60
TRH      60
DTF      60
SDS      11
Name: team_id, Length: 104, dtype: int64

In [11]:
nba.loc[nba["fran_id"] == "Lakers", "team_id"].value_counts()

LAL    5078
MNL     946
Name: team_id, dtype: int64

In [12]:
nba.loc[nba["team_id"] == "MNL", "date_game"].min()

'1/1/1949'

In [13]:
nba.loc[nba["team_id"] == "MNL", "date_game"].max()

'4/9/1959'

In [14]:
nba.loc[nba["team_id"] == "MNL", "date_game"].agg(("min", "max"))

min    1/1/1949
max    4/9/1959
Name: date_game, dtype: object

In [15]:
nba.loc[nba["team_id"] == "BOS", "pts"].sum()

626484

In [16]:
revenues = pd.Series([5555, 7000, 1980])
revenues.values
revenues.index
type(revenues.values)
city_revenues = pd.Series(
        [4200, 8000, 6500],
        index=["Amsterdam", "Toronto", "Tokyo"]
    )
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count.keys()
"Tokyo" in city_employee_count

True

In [17]:
city_data = pd.DataFrame({"revenue": city_revenues, "employee_count": city_employee_count})

In [18]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [19]:
city_data.values

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

In [20]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [21]:
"Amsterdam" in city_data

False

In [22]:
nba.index

RangeIndex(start=0, stop=126314, step=1)

In [23]:
nba.axes

[RangeIndex(start=0, stop=126314, step=1),
 Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
        'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
        'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
        'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
       dtype='object')]

In [24]:
"points" in nba.keys()

False

In [89]:
colors = pd.Series( ["red", "purple", "blue", "green", "yellow"], index=[1, 2, 3, 5, 8])

In [93]:
colors[1] # unexpected results due to the labels

'red'

In [27]:
colors.loc[1]

'red'

In [28]:
colors.iloc[1]

'purple'

In [29]:
colors.iloc[1:2]

2    purple
dtype: object

In [30]:
colors.loc[1:2]

1       red
2    purple
dtype: object

In [31]:
colors.iloc[-2]

'green'

In [32]:
city_data["revenue"]

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [33]:
city_data["revenue"][1]

6500

In [34]:
city_data["revenue"]["Amsterdam"]

4200

# Dictionaries

In [36]:
# make a dictionary
data = {
         'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
        'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai','Manchester', 'Cairo', 'Osaka'],
         'age': [41, 28, 33, 34, 38, 31, 37],
        'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
    }

row_labels = [101, 102, 103, 104, 105, 106, 107] # save for later

In [47]:
# convert dictionary to Pandas DF
df = pd.DataFrame(data = data) # , index= row_labels)
df

     name         city  age  py-score
0  Xavier  Mexico City   41      88.0
1     Ann      Toronto   28      79.0
2    Jana       Prague   33      81.0
3      Yi     Shanghai   34      80.0
4   Robin   Manchester   38      68.0
5    Amal        Cairo   31      61.0
6    Nori        Osaka   37      84.0

In [38]:
df.head()
df.tail()
df['city']

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [39]:
df.city

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [42]:
df.city[102]

'Toronto'

In [53]:
df.iloc[:,0]

0    Xavier
1       Ann
2      Jana
3        Yi
4     Robin
5      Amal
6      Nori
Name: name, dtype: object

In [43]:
import numpy as np

In [44]:
d = {'x': [1, 2, 3], 'y': np.array([2, 4, 8]), 'z': 100}

In [56]:
# crete DF with a dictionary
pd.DataFrame(d, index = [100, 200, 300], columns = ['z', 'y', 'x'])

       z  y  x
100  100  2  1
200  100  4  2
300  100  8  3

In [57]:
# create DF with lists
l = [{'x': 1, 'y': 2, 'z': 100},
     {'x': 2, 'y': 4, 'z': 100},
     {'x': 3, 'y': 8, 'z': 100}]
pd.DataFrame(l)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [61]:
# from nested list
l = [[1,2,100], [2,4, 100], [3,8,100]]
pd.DataFrame(l, columns = ['x', 'y', 'z'], index = [100,200, 300])

     x  y    z
100  1  2  100
200  2  4  100
300  3  8  100

In [73]:
# from Numpy Array
arr = np.array(l)
df = pd.DataFrame(arr, columns = ['x', 'y', 'z'])
arr

array([[  1,   2, 100],
       [  2,   4, 100],
       [  3,   8, 100]])

In [74]:
df

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [75]:
arr[0,0]

1

In [84]:
df.iloc[0,0]

1

In [85]:
df.iloc[0,0] = 3

In [86]:
arr[0,0]

3

In [87]:
# change copy = false to unpair
arr = np.array(l)
df = pd.DataFrame(arr, columns = ['x', 'y', 'z'], copy = False)

In [88]:
df.iloc[0,0] = 3
arr[0,0]

3

In [99]:
data = {
         'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
        'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai','Manchester', 'Cairo', 'Osaka'],
         'age': [41, 28, 33, 34, 38, 31, 37],
        'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
    }

row_labels = [101, 102, 103, 104, 105, 106, 107] # save for later
df = pd.DataFrame(data = data, index= row_labels)

In [100]:
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [101]:
df.index

Int64Index([101, 102, 103, 104, 105, 106, 107], dtype='int64')

In [107]:
np.arange(10, 17) # create range from numpy

array([10, 11, 12, 13, 14, 15, 16])

In [111]:
df.index = np.arange(10, 17)

In [112]:
df.index

Int64Index([10, 11, 12, 13, 14, 15, 16], dtype='int64')

In [113]:
df['name']

10    Xavier
11       Ann
12      Jana
13        Yi
14     Robin
15      Amal
16      Nori
Name: name, dtype: object

In [114]:
df.loc[10]

name             Xavier
city        Mexico City
age                  41
py-score           88.0
Name: 10, dtype: object

In [115]:
df.loc[11:15, ['name', 'city']]

     name        city
11    Ann     Toronto
12   Jana      Prague
13     Yi    Shanghai
14  Robin  Manchester
15   Amal       Cairo

In [119]:
df.iloc[1:6, 0:2]

     name        city
11    Ann     Toronto
12   Jana      Prague
13     Yi    Shanghai
14  Robin  Manchester
15   Amal       Cairo

In [120]:
df.iloc[1:6:2] # from 1 to 6 by 2

    name      city  age  py-score
11   Ann   Toronto   28      79.0
13    Yi  Shanghai   34      80.0
15  Amal     Cairo   31      61.0

In [121]:
df.at[12, 'name']

'Jana'

In [122]:
df.iat[2, 0]

'Jana'

In [124]:
df.drop(labels = [11])

      name         city  age  py-score
10  Xavier  Mexico City   41      88.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [125]:
df # not deleted

      name         city  age  py-score
10  Xavier  Mexico City   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [128]:
john = pd.Series(data=['John', 'Boston', 34, 79],
                 index=df.columns, name=17)
john

name          John
city        Boston
age             34
py-score        79
Name: 17, dtype: object

In [129]:
df.append(john)

      name         city  age  py-score
10  Xavier  Mexico City   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0
17    John       Boston   34      79.0

In [130]:
df # not there

      name         city  age  py-score
10  Xavier  Mexico City   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [131]:
df = df.append(john)

In [132]:
df

      name         city  age  py-score
10  Xavier  Mexico City   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0
17    John       Boston   34      79.0

In [139]:
df.drop(labels = [17], inplace=True) # actually drops the value

In [140]:
df

      name         city  age  py-score
10  Xavier  Mexico City   41      88.0
11     Ann      Toronto   28      79.0
12    Jana       Prague   33      81.0
13      Yi     Shanghai   34      80.0
14   Robin   Manchester   38      68.0
15    Amal        Cairo   31      61.0
16    Nori        Osaka   37      84.0

In [141]:
df.drop(labels = ['name'], axis = 1) # drop a column

           city  age  py-score
10  Mexico City   41      88.0
11      Toronto   28      79.0
12       Prague   33      81.0
13     Shanghai   34      80.0
14   Manchester   38      68.0
15        Cairo   31      61.0
16        Osaka   37      84.0

In [148]:
df['js-score'] = [71.0, 95.0, 88.0, 79.0, 91.0, 91.0, 80.0]
df

      name         city  age  py-score  js-score
10  Xavier  Mexico City   41      88.0      71.0
11     Ann      Toronto   28      79.0      95.0
12    Jana       Prague   33      81.0      88.0
13      Yi     Shanghai   34      80.0      79.0
14   Robin   Manchester   38      68.0      91.0
15    Amal        Cairo   31      61.0      91.0
16    Nori        Osaka   37      84.0      80.0

In [144]:
df.dtypes

name         object
city         object
age           int64
py-score    float64
js-score    float64
dtype: object

In [150]:
df.memory_usage()

Index       56
name        56
city        56
age         56
py-score    56
js-score    56
dtype: int64

In [157]:
df['js-score'] = np.array([71.0, 95.0, 88.0, 79.0, 91.0, 91.0, 80.0], dtype = int)

In [152]:
df.memory_usage()

Index       56
name        56
city        56
age         56
py-score    56
js-score    56
dtype: int64

In [154]:
df.dtypes

name         object
city         object
age           int64
py-score    float64
js-score      int64
dtype: object

In [158]:
df["pretendcol"] = 0

In [159]:
df

      name         city  age  py-score  js-score  pretendcol
10  Xavier  Mexico City   41      88.0        71           0
11     Ann      Toronto   28      79.0        95           0
12    Jana       Prague   33      81.0        88           0
13      Yi     Shanghai   34      80.0        79           0
14   Robin   Manchester   38      68.0        91           0
15    Amal        Cairo   31      61.0        91           0
16    Nori        Osaka   37      84.0        80           0

In [160]:
df.drop(axis = 1, labels='pretendcol', inplace=True)

In [161]:
df

      name         city  age  py-score  js-score
10  Xavier  Mexico City   41      88.0        71
11     Ann      Toronto   28      79.0        95
12    Jana       Prague   33      81.0        88
13      Yi     Shanghai   34      80.0        79
14   Robin   Manchester   38      68.0        91
15    Amal        Cairo   31      61.0        91
16    Nori        Osaka   37      84.0        80

In [169]:
df.insert(loc = 4, column = "inserted", value = 0)

In [164]:
df

      name         city  age  py-score  inserted  js-score
10  Xavier  Mexico City   41      88.0         0        71
11     Ann      Toronto   28      79.0         0        95
12    Jana       Prague   33      81.0         0        88
13      Yi     Shanghai   34      80.0         0        79
14   Robin   Manchester   38      68.0         0        91
15    Amal        Cairo   31      61.0         0        91
16    Nori        Osaka   37      84.0         0        80

In [170]:
del df['inserted']

In [171]:
df

      name         city  age  py-score  js-score
10  Xavier  Mexico City   41      88.0        71
11     Ann      Toronto   28      79.0        95
12    Jana       Prague   33      81.0        88
13      Yi     Shanghai   34      80.0        79
14   Robin   Manchester   38      68.0        91
15    Amal        Cairo   31      61.0        91
16    Nori        Osaka   37      84.0        80